session_5/collegedb/app/controllers/application_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_student
        if session[:student_id]
            @current_student ||= Student.find(session[:student_id])