session_5/collegedb/app/controllers/assignments_controller.rb

  def update
    @assignment = Assignment.find(params[:id])
    if @assignment.update(assignment_params)
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "assignments" SET "updated_at" = ? WHERE "assignments"."id" = ?  [["updated_at", "2021-02-03 12:32:33.752706"], ["id", 2]]

  def destroy
    @assignment = Assignment.find(params[:id])
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]