session_5/collegedb/app/controllers/sessions_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "samarthmayya@gmail.com"], ["LIMIT", 1]]
---
  def create
    student = Student.find_by_email(params[:email])