session_5/collegedb/app/views/courses/show.html.erb


<% current_student.courses.find(@course.id).assignments.each do |assignment| %>
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."course_id" = ?  [["course_id", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "registrations" ON "courses"."id" = "registrations"."course_id" WHERE "registrations"."student_id" = ? AND "courses"."id" = ? LIMIT ?  [["student_id", 1], ["id", 1], ["LIMIT", 1]]